     A          R TESTFR
     A            TSFLD1        10A
     A            TSFLD2        10A
     A            TSFLD3        10A
     A            TSFLD4        10A
